#[allow(dead_code)]
pub(crate) fn area_h_str() -> Vec<HStrArea> {
    vec![
        (1, "Палуба бака 17 шпация",   31.52,   35.5164, 41.4358),
        (1, "Палуба бака 18 шпация",   18.01,   41.4358, 47.3554),
        (1, "Палуба бака 19 шпация",   25.05,   47.3554, 53.2746),
        (1, "Палуба бака 20 шпация",   60.62,   53.2746, 59.194),
        (1, "Верхняя палуба",          1334.,    -60.994, 38.956), 
        (1, "Палуба ходового мостика", 197.8,   37.006,  52.156), 
        (1, "Спасательная шлюпка",     13.9,    -60.394, -53.194),  
        (1, "Посадочная площадка",     4.2,     -60.394, -56.194),  
        (1, "Дежурная шлюпка",         6.6,     38.306,  40.156),  
        (1, "Дымовые трубы",           12.1,    -51.994, -49.594)
    ]
}