#[allow(dead_code)]
pub(crate) fn area_h_stab() -> Vec<HStabArea> {
    vec![
        (1, "Палуба бака",              135.2,    48.9,  0.,     9.5),
        (1, "Верхняя палуба",           423.4,   -24.5,  0.,     6.9),
        (1, "Крышки люков трюма",       872.7,   -3.3,   0.,     8.9),
        (1, "Комингсы",                 37.8,    -3.6,   0.,     8.2),
        (1, "Палуба ходового мостика",  81.1,     42.0,  0.,     12.4), 
        (1, "Крыша рубки",              116.7,    47.4,  0.,     16.0),   
        (1, "Спасательная шлюпка",      13.9,    -57.9, -4.5,   13.0),  
        (1, "Посадочная площадка",      4.2,     -57.9, -4.5,   6.8),  
        (1, "Дежурная шлюпка",          6.6,      39.0,  0.0,   13.2),  
        (1, "Дымовые трубы",            12.1,    -51.0,  0.0,   15.6)
    ]
}