use std::collections::HashMap;

use crate::data::structs::loads::{CargoGeneralCategory, LoadCargoArray, CompartmentArray, CompartmentData, MatterType};
///
impl From<Vec<(  
    &str,
    Option::<f64>,
    Option::<f64>,
    Option::<f64>,
    f64,
    f64,
    Option::<f64>,
    Option::<f64>,
    Option::<f64>,
    Option::<f64>,
    Option::<f64>,
    Option::<f64>,
    CargoGeneralCategory,
    MatterType
)>> for CompartmentArray {
    fn from(src: Vec<(&str,
        Option::<f64>,
        Option::<f64>,
        Option::<f64>,
        f64,
        f64,
        Option::<f64>,
        Option::<f64>,
        Option::<f64>,
        Option::<f64>,
        Option::<f64>,
        Option::<f64>,
        CargoGeneralCategory,
        MatterType
    )>) -> Self {
        Self {
            data: src
                .into_iter()
                .map(|(                    
                    name,                    
                    mass,
                    density,
                    volume,
                    bound_x1,
                    bound_x2,
                    mass_shift_x,
                    mass_shift_y,
                    mass_shift_z,
                    m_f_s_y,
                    m_f_s_x,
                    grain_moment,
                    general_category,
                    matter_type,
                )| CompartmentData {
                    name: name.to_owned(),
                    mass,
                    density,
                    volume,
                    bound_x1,
                    bound_x2,
                    mass_shift_x,
                    mass_shift_y,
                    mass_shift_z,
                    m_f_s_y,
                    m_f_s_x,
                    grain_moment,
                    general_category,
                    matter_type,
                })
                .collect(),
            error: HashMap::new(),
        }
    }
}
///
#[allow(dead_code)]
pub(crate) fn cargo() -> CompartmentArray {
    CompartmentArray::from(vec![
        // (name, volume_max, density, bound_x1, bound_x2, bound_y1, bound_y2, bound_z1, bound_z2, category_id, svg_paths)
        ("Форпик Пр.Б",     58.79,   1.025, 54.556,  59.356, 5.346370, 0, .316583, 6.800000, 2, ),
              ("Форпик ЛБ",       58.79,   1.025, 54.556,  59.356, 0, -5.346370, .316583, 6.800000, 2, ),
              ("Балласт 1 Пр.Б",  48.73,   1.025, 38.956,  51.556, 6.700000, 0, 0, .820000, 2, ),
              ("Балласт 1 ЛБ",    53.19,   1.025, 38.956,  51.556, 0, -6.700000, 0, .820000, 2,),
              ("Балласт 2 Пр.Б",  115.57,  1.025, 27.256,  38.956, 6.700000, 5.200000, 0, 6.850000, 2, ),
              ("Балласт 2 ЛБ",    115.57,  1.025, 27.256,  38.956, -5.200000, -6.700000, 0, 6.850000, 2, ),
              ("Балласт 2 ДД",    96.78,   1.025, 27.256,  38.956, 5.200000, -5.200000, 0, .820000, 2, ),
              ("Балласт 3 Пр.Б",  115.57,  1.025, 15.556,  27.256, 6.700000, 5.200000, 0, 6.850000, 2, ),
              ("Балласт 3 ЛБ",   115.57,  1.025, 15.556,  27.256, -5.200000, -6.700000, 0, 6.850000, 2, ),
              ("Балласт 3 ДД",   96.78,   1.025, 15.556,  27.256, 5.200000, -5.200000, 0, .820000, 2, ),
              ("Балласт 4 Пр.Б", 186.19,  1.025, -3.294,   15.556, 6.700000, 5.200000, 0, 6.850000, 2, ),
              ("Балласт 4 ЛБ",   186.19,  1.025, -3.294,   15.556, -5.200000, -6.700000, 0, 6.850000, 2, ),
              ("Балласт 4 ДД",   155.93,  1.025, -3.294,   15.556, 5.200000, -5.200000, 0, .820000, 2, ),
              ("Балласт 5 Пр.Б", 186.19,  1.025, -22.144,   -3.294, 6.700000, 5.200000, 0, 6.850000, 2, ),
              ("Балласт 5 ЛБ",   186.19,  1.025, -22.144,   -3.294, -5.200000, -6.700000, 0, 6.850000, 2, ),
              ("Балласт 5 ДД",   155.93,  1.025, -22.144,   -3.294, 5.200000, -5.200000, 0, .820000, 2, ),
              ("Балласт 6 Пр.Б", 121.99,  1.025, -34.494,   -22.144, 6.700000, 5.200000, 0, 6.850000, 2, ),
              ("Балласт 6 ЛБ",   121.99,  1.025, -34.494,   -22.144, -5.200000, -6.700000, 0, 6.850000, 2, ),
              ("Балласт 6 ДД",   102.16,  1.025, -34.494,   -22.144, 5.200000, -5.200000, 0, .820000, 2, ),
              ("Балласт 7 Пр.Б", 113.59,  1.025, -45.994,   -34.494, 6.700000, 5.200000, 0, 6.850000, 2, ),
              ("Балласт 7 ЛБ",   113.59,  1.025, -45.994,   -34.494,  -5.200000, -6.700000, 0, 6.850000, 2, ),
              ("Балласт 7 ДД",   95.13,   1.025, -45.994,   -34.494, 5.200000, -5.200000, 0, .820000, 2, ),
              ("Цистерна расходного топлива 1 ЛБ",   6.4,  0.86, -55.594,  -53.194, -1.100000, -2.350000, 4.200000, 6.400000, 4, ),
              ("Цистерна расходного топлива 2 ЛБ",   6.4,  0.86, -55.594,  -53.194, -2.350000, -3.600000, 4.200000, 6.400000, 4, ),
              ("Цистерна запасного топлива 1 Пр.Б",  40.67, 0.86, -45.994, -44.194, 5.200000, 0, .820000, 6.850000, 4, ),
              ("Цистерна запасного топлива 2 ЛБ",    40.81, 0.86, -45.994, -44.194, 0, -5.200000, .820000, 6.850000, 4, ),
              ("Цистерна запасного топлива 3 Пр.Б",  62.12, 0.86, -57.394,  -53.194, 6.700000, 0, 1.044484, 4.200000, 4, ),
              ("Цистерна запасного топлива 3 ЛБ",    62.12, 0.86, -57.394,  -53.194, 0, -6.700000, 1.044484, 4.200000, 4, ),
              ("Цистерна переливная ДП",             16.37, 0.86, -48.994, -45.994, 2.100000, -2.100000, 0, 1.400000, 4, ),
              ("Цистерна расходного топлива АДГ Пр.Б",     1.24,  0.86, 39.556, 40.756, 2.335000, 1.710000, 10.754000, 12.354000, 4, ),
              ("Цистерна пресной воды 1 ДП (носовая)",     45.09, 1,    41.356, 43.756, 2.000000, -4.500000, .820000, 3.800000, 7, ),
              ("Цистерна пресной воды 2 Пр.Б (кормовая)",  3.94,  1,    -53.194,   -51.994, 5.835000, 3.445000, 4.200000, 6.834799, 7, ),
              ("Цистерна питьевой воды 1 ЛБ",  3.71, 1,   40.156, 42.556, -.200000, -.950000, 4.000000, 6.000000, 7, ),
              ("Цистерна питьевой воды 2 ЛБ",  3.71, 1,   -24.744, 42.556, -.950000, -1.700000, 4.000000, 6.000000, 7,),
              ("Цистерна запасного масла ГД",  2.77, 0.9, -53.194, -51.994, 1.050000, 0, 4.200000, 6.400000, 5, ),
              ("Цистерна запасного масла ДГ",  2.77, 0.9, -53.194, -51.994, 2.100000, 1.050000, 4.200000, 6.400000, 5, ),
              ("Цистерна отработанного масла ЛБ", 4.25, 0.9, -53.194, -48.994, -.900000, -2.100000, .180652, 1.400000, 5, ),
              ("Цистерна мочевины ДП",         28.22, 1.32, -53.194, -50.794, 2.100000, -2.100000, 1.400000, 4.200000, 6,),
              ("Цистерна нефтеостатков ДП",    8.5,  0.86, -53.194, -48.994, 1.500000, -.900000, .180652, 1.400000, 8, ),
              ("Шламовая цистерна Пр.Б",       2.12,  0.86, -53.194, -48.994, 2.100000, 1.500000, .180652, 1.400000, 8, ),
              ("Сточная цистерна 1 ДП",        15.35, 0.86, 49.756, 51.556, 2.000000, -1.500000, 1.320000, 3.800000, 8,),
              ("Сточная цистерна 2 ЛБ",        0.7,  0.86, -53.194, -51.994, -5.000000, -6.000000, 2.500000, 3.200000, 8, );
            
      //        (ship_id, space_id, name, mass, bound_x1, bound_x2, mass_shift_x, mass_shift_y, mass_shift_z, category_id)
              ("Экипаж и багаж",     1.80, 44.31,  46.31, 45.31,  -4.46,  7.70, 9),
              ("Провизия",           0,    40.21,  42.21, 41.21,  4.60,   8.15, 9),
            
     //         (ship_id, space_id, name, active, mass, bound_x1, bound_x2, mass_shift_x, mass_shift_y, mass_shift_z, category_id)

              ("Палубный груз", TRUE, 0, -44.194, 37.656,  0,  0,  10.3, 10),
    ])
}